RhinoInside.Revit API Documentation
GeometryDecoder.ToTransform Method
 Converts the specified Plane to an equivalent Rhino Transform.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.Transform ToTransform(
	this Autodesk.Revit.DB.Transform value
)
@staticmethod
def ToTransform(
	value: Autodesk.Revit.DB.Transform
) -> Rhino.Geometry.Transform
Parameters
value
Type: Autodesk.Revit.DB.Transform
A value to convert.
Return Value
Type: Rhino.Geometry.Transform
A Rhino Transform that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Transform. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace